[
  {
    "job_title": "MEAN Stack Developer",
    "company": "S Ventures",
    "location": "Islamabad",
    "description": "* Building interactive consumer data from multiple systems and RESTfully abstract to the UI through a Node.js backend\n* Define code architecture decisions to support a high-performance and scalable product with a minimal footprint\n* Address and improve any technical issues\n* Collaborate well with engineers, researchers, and data implementation specialists to design and create advanced, elegant and efficient systems\n\nJob Type: Full-time\n\nWork Location: In person",
    "apply_link": null,
    "jobNature": "onsite",
    "experience": "Not specified",
    "salary": null
  },
  {
    "job_title": "Fullstack .Net Developer",
    "company": "Zepto Systems Limited",
    "location": "Islamabad",
    "description": "*Qualifications*\n\n- 2-5 years of experience in full stack development using React.js and .NET Core\n\n- Hands-on with SQL/NoSQL databases\n\n- Experience with Azure services\n\n- Knowledge of modern development tools and architectures\n\n- A proactive problem-solver and a great team player\n\nJob Type: Full-time\n\nPay: Rs120,000.00 - Rs180,000.00 per month\n\nWork Location: In person",
    "apply_link": null,
    "jobNature": "onsite",
    "experience": "2-5 years of experience",
    "salary": null
  },
  {
    "job_title": "Full Stack Developer (Laravel+Vue)",
    "company": "Hybrid Mediaworks",
    "location": "Islamabad",
    "description": "Based in Washington US, Hybrid Mediaworks is a custom web design and development services company, delivering industry-specific customized website solutions to businesses. Our clients range from start-ups to established enterprises and we are committed to helping businesses communicate their brand story through their online presence. Our regional office in Pakistan is located in Islamabad and we have a team of talented professionals who are passionate about delivering high quality work.\n\n*Job Description:*\n\nWe are looking for a skilled Laravel Full Stack Developer with experience in Vue.js/React.js to join our team. The candidate should have a strong background in building web applications using Laravel and Vue.js/React.js, as well as experience with modern front-end technologies.\n\n*Laravel Full Stack Developer Responsibilities:*\n* Develop and maintain web applications using Laravel and Vue.js/React.js\n* Collaborate with designers, developers, and project managers to build responsive and user-friendly interfaces\n* Participate in code reviews and help improve code quality\n* Build reusable code and libraries for future use\n* Write clean, efficient, and well-documented code\n* Stay up-to-date with emerging technologies and frameworks\n* Identify and resolve technical problems and bugs\n* Collaborate with other team members to define and implement features\n\nRequirements\n* At least 3 years of experience working as a full stack developer with Laravel and Vue.js/React.js\n* Proficient in PHP, JavaScript, HTML, CSS, and MySQL\n* Experience with Laravel Blade and Vue.js templates\n* Strong understanding of MVC architecture and RESTful API design\n* Familiarity with Git version control system\n* Experience with unit testing, integration testing, and test-driven development\n* Knowledge of server administration and deployment using tools like AWS, Docker, and Kubernetes\n* Excellent communication and collaboration skills\n\nBenefits\n\n*Why should you Join Hybrid MediaWorks?*\n\nAt Hybrid Media works, we value your career growth. We offer a clear and transparent career path to help you achieve your life goals. Some of our benefits include:\n\n- Competitive basic salaries, personal and team-based bonuses, and additional incentives.\n\n- Regular team social events and awards for outstanding performance.\n\n- Additional benefits include cash prizes, monthly team meetups, annual dinners, paid leaves, health insurance, and bonuses.\n\n*It’s an onsite Position*\n\n*Timings:* 04:00 PM to 01:00 AM\n\n*Location:* Hybrid Media works, First Floor, Plot # 176 Korang Road, near Rahat Bakers, I-10/3, Islamabad.\n\nJob Type: Full-time\n\n\n\nApplication Question(s):\n* What are your salary expectations?\n* Our timings are from 4pm to 1am. Will you be comfortable working in this time slot?\n\nExperience:\n* React.js: 1 year (Required)\n* Vue.js: 2 years (Required)\n\nWork Location: In person",
    "apply_link": null,
    "jobNature": "onsite",
    "experience": "3 years of experience",
    "salary": null
  }
]